perf/results/single-node/breakpoint/cfg-breakpoint-sync.yaml
config:
  environments:
    sync:
      target: 'http://localhost:5555/node/sync'
      plugins:
        statsd:
          host: localhost
          port: 8125
          prefix: "artillery-node"

  pool: 50 # All HTTP requests from all virtual users will be sent over the same connections

  phases:
    - name: Warmup Line
      duration: 25
      arrivalRate: 1
    - name: Slow Ramp # used by slow endpoints
      duration: 300   # seconds
      arrivalRate: 1
      rampTo: 100 # 20
    - name: Reset Line  # useful for resetting Grafana stats
      duration: 30
      arrivalRate: 1

scenarios:
  - name: Root (/)
    flow:
      - get:
          url: '/'